podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal.Check/peripherals/ADC0_MK60F12.svd.xml
<!--
Devices using this peripheral: 
      MK60F12
      MK60F15
      MK61F12
      MK61F15
      MK70F12
      MK70F15
-->
      <peripheral>
         <?sourceFile "ADC0_MK60F12" ?>
         <name>ADC0</name>
         <description>Analog-to-Digital Converter</description>
         <prependToName>ADC0</prependToName>
         <headerStructName>ADC</headerStructName>
         <baseAddress>0x4003B000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x70</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>A,B</dimIndex>
               <name>SC1%s</name>
               <description>Status and Control Register 1</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x1F</resetValue>
               <fields>
                  <field>
                     <name>ADCH</name>
                     <description>Input Channel Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000</name>
                           <description>DADP0 / DAD0</description>
                           <value>0b00000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00001</name>
                           <description>DADP1 / DAD1</description>
                           <value>0b00001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00010</name>
                           <description>DADP2 / DAD2</description>
                           <value>0b00010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00011</name>
                           <description>DADP3 / DAD3</description>
                           <value>0b00011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00100</name>
                           <description>AD4 / Reserved</description>
                           <value>0b00100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00101</name>
                           <description>AD5 / Reserved</description>
                           <value>0b00101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00110</name>
                           <description>AD6 / Reserved</description>
                           <value>0b00110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00111</name>
                           <description>AD7 / Reserved</description>
                           <value>0b00111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01000</name>
                           <description>AD8 / Reserved</description>
                           <value>0b01000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01001</name>
                           <description>AD9 / Reserved</description>
                           <value>0b01001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01010</name>
                           <description>AD10 / Reserved</description>
                           <value>0b01010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01011</name>
                           <description>AD11 / Reserved</description>
                           <value>0b01011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01100</name>
                           <description>AD12 / Reserved</description>
                           <value>0b01100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01101</name>
                           <description>AD13 / Reserved</description>
                           <value>0b01101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01110</name>
                           <description>AD14 / Reserved</description>
                           <value>0b01110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01111</name>
                           <description>AD15 / Reserved</description>
                           <value>0b01111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10000</name>
                           <description>AD16 / Reserved</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10001</name>
                           <description>AD17 / Reserved</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10010</name>
                           <description>AD18 / Reserved</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10011</name>
                           <description>AD19 / Reserved</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10100</name>
                           <description>AD20 / Reserved</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10101</name>
                           <description>AD21 / Reserved</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10110</name>
                           <description>AD22 / Reserved</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10111</name>
                           <description>AD23 / Reserved</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11000</name>
                           <description>Reserved</description>
                           <value>0b11000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11001</name>
                           <description>Reserved</description>
                           <value>0b11001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11010</name>
                           <description>Temperature (single/differential)</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11011</name>
                           <description>Bandgap (single/differential)</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11100</name>
                           <description>Reserved</description>
                           <value>0b11100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11101</name>
                           <description>VRefSH / -VRefSH (differential)</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11110</name>
                           <description>VRefSL / Reserved</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11111</name>
                           <description>Module is disabled</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF</name>
                     <description>Differential Mode Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Single-ended</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Differential</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AIEN</name>
                     <description>Conversion Complete Interrupt Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COCO</name>
                     <description>Conversion Complete Flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not complete</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Complete</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG1</name>
               <description>Configuration Register 1</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>ADICLK</name>
                     <description>Input Clock Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Bus clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>(Bus clock)/2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Alternate clock</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Asynchronous clock</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Conversion mode selection\n
DIFF mode is not supported on all devices</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>8-bit/9-bit-2&apos;s complement</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>12-bit/13-bit-2&apos;s complement</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>10-bit/11-bit-2&apos;s complement</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>16-bit/16-bit-2&apos;s complement</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLSMP</name>
                     <description>Sample Time Configuration</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Short sample time</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Long sample time</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADIV</name>
                     <description>Clock Divide Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Divide by 1</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Divide by 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Divide by 4</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Divide by 8</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADLPC</name>
                     <description>Low-Power Configuration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal power configuration</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Low-power configuration\tThe power is reduced at the expense of maximum clock speed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG2</name>
               <description>Configuration Register 2</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ADLSTS</name>
                     <description>Long Sample Time Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>20 extra cycles\t- 24 cycles total</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>12 extra cycles\t- 16 cycles total sample time</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>6 extra cycles\t- 10 cycles total sample time</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>2 extra cycles\t- 6 cycles total sample time</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADHSC</name>
                     <description>High-Speed Configuration</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal conversion</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>High-speed conversion</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADACKEN</name>
                     <description>Asynchronous Clock Output Enable\n
Controls whether the Asynchronous clock output is always enabled or only as required</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Only as required</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Always available</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXSEL</name>
                     <description>Mux Select\nSelect between A and B channels</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ADxxa channels</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ADxxb channels</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>A,B</dimIndex>
               <name>R%s</name>
               <description>Data Result Register</description>
               <addressOffset>0x10</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>D</name>
                     <description>Data result</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,2</dimIndex>
               <name>CV%s</name>
               <description>Compare Value</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>CV</name>
                     <description>Compare Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
