podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal.Check/peripherals/ADC0_MK60F12.svd.xml
            <register>
               <name>SC2</name>
               <description>Status and Control Register 2</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>REFSEL</name>
                     <description>Voltage Reference Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>VREFH and VREFL</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>VALTH and VALTL</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1X</name>
                           <description>Reserved</description>
                           <value>0b1X</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>DMA disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA enabled\t Will be asserted when an ADC conversion completes</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACREN</name>
                     <description>Compare Function Range Enable\n
Controls whether a single threshold is used (CV1) or an range defined by CV1 &amp; CV2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Single - CV1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Range - CV1 &amp; CV2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACFGT</name>
                     <description>Compare Function Greater Than Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Configures less than threshold, outside range not inclusive and inside range not inclusive; 
                           functionality based on the values placed in CV1 and CV2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Configures greater than or equal to threshold, outside and inside ranges inclusive; 
                           functionality based on the values placed in CV1 and CV2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACFE</name>
                     <description>Compare Function Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Compare function disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Compare function enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADTRG</name>
                     <description>Conversion Trigger Select\n
Controls whether conversions are triggered by writes to ADC_SC1 (software) or assertion of ADHWT input (hardware)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Software trigger selected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Hardware trigger selected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADACT</name>
                     <description>Conversion Active</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Conversion not in progress</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Conversion in progress</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SC3</name>
               <description>Status and Control Register 3</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>AVGS</name>
                     <description>Hardware Average Select\n
Selects the number of averages taken if hardware averaging is enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>4 samples</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>8 samples</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>16 samples</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>32 samples</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AVGE</name>
                     <description>Hardware Average Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCO</name>
                     <description>Continuous Conversion Enable\n
Enables continuous conversions or sets of conversions (when averaging) after an initial trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>One set of conversions</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Continuous conversions</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CALF</name>
                     <description>Calibration Failed Flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Calibration completed OK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Calibration failed\tADC accuracy specifications are not guaranteed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAL</name>
                     <description>Calibration</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OFS</name>
               <description>Offset Correction Register</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>OFS</name>
                     <description>Offset Error Correction Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PG</name>
               <description>Plus-Side Gain Register</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x8200</resetValue>
               <fields>
                  <field>
                     <name>PG</name>
                     <description>Plus-Side Gain</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MG</name>
               <description>Minus-Side Gain Register</description>
               <addressOffset>0x30</addressOffset>
               <resetValue>0x8200</resetValue>
               <fields>
                  <field>
                     <name>MG</name>
                     <description>Minus-Side Gain</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPD</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x34</addressOffset>
               <resetValue>0xA</resetValue>
               <fields>
                  <field>
                     <name>CLPD</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLPS</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x38</addressOffset>
               <resetValue>0x20</resetValue>
               <fields>
                  <field>
                     <name>CLPS</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP4</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x3C</addressOffset>
               <resetValue>0x200</resetValue>
               <fields>
                  <field>
                     <name>CLP4</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP3</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x40</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>CLP3</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP2</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x44</addressOffset>
               <resetValue>0x80</resetValue>
               <fields>
                  <field>
                     <name>CLP2</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP1</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x48</addressOffset>
               <resetValue>0x40</resetValue>
               <fields>
                  <field>
                     <name>CLP1</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLP0</name>
               <description>Plus-Side General Calibration Value</description>
               <addressOffset>0x4C</addressOffset>
               <resetValue>0x20</resetValue>
               <fields>
                  <field>
                     <name>CLP0</name>
                     <description>Calibration Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
